public class ProgramForTask2 {
    public static void main(String[] args) {
        double randomDecimalNumber = 7.5;
        System.out.println("Произвольное значение переменной типа с плавающей точкой с наибольшим диапазоном чисел (double) равно: " + randomDecimalNumber);

        byte biggestByte = 127;
        System.out.println("Наибольшее возможное значение переменной целочисленного типа с наименьшим диапазоном чисел (byte) равно: " + biggestByte);

    }
}

/*
Создание переменных:
1. Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел. Присвойте ей произвольное дробное значение
2. Создайте переменную целочисленного типа с наименьшим диапазоном чисел. Присвойте ей наибольшее возможное значение
Выполненное задания нужно залить в гит и оставить ссылку здесь в поле "Ответ". Задание автоматически уйдет на оценку преподавателю
*/